In [1]:
import pandas as pd

In [3]:
# 데이터프레임 만들기
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [4]:
# 시리즈 만들기
pd.Series([20, 30, 40], name='Age')

0    20
1    30
2    40
Name: Age, dtype: int64

In [6]:
df.Age.max()

58

In [7]:
# 데이터 가져올 path 잡기
path = '../datasets/ML_data/'

In [9]:
# csv 가져오기
raw = pd.read_csv(path+'Advertising.csv')
ad = raw.copy()
ad.head(2)

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4

In [11]:
ad.dtypes

Unnamed: 0      int64
TV            float64
Radio         float64
Newspaper     float64
Sales         float64
dtype: object

In [12]:
ad.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [ ]:
# # csv 저장
# ad.to_csv(path+'Advertising_new.csv', index=False)